artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 20
      name: "Warm up phase"
    - duration: 120
      arrivalRate: 20
      rampTo: 50
      name: "Ramp up load"
    - duration: 600
      arrivalRate: 50
      name: "Sustained load"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Chat API"
    flow:
      - post:
          url: "/api/chat"
          json:
            message: "Hello, Beluga!"
            context: []
            sessionId: "{{ $randomString() }}"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: response
      - think: 5
  - name: "DeepResearch API"
    flow:
      - post:
          url: "/api/deep-research"
          json:
            query: "What is the impact of AI on job markets?"
            depth: 3
            sessionId: "{{ $randomString() }}"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: result
      - think: 10